# oh-my-zsh
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# node
brew "node"
brew "nvm"

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "direnv"

# nerd font
brew "font-jetbrains-mono-nerd-font"

# neovim
brew "black"
brew "isort"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "unzip"
brew "ripgrep"
