# general
brew "lazygit"
brew "tmux"
brew "wget"

# casks
cask "raycast"
cask "rectangle"

# docker
brew "docker"
brew "docker-compose""
brew "colima"

# oh-my-zsh
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "direnv"

# node
brew "node"
brew "fnm"

# lua
brew "lua-language-server"

# neovim
brew "neovim"
brew "luarocks"
brew "unzip"
brew "ripgrep"

# nerd fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-blex-mono-nerd-font"

# file viewers
brew "jless"
brew "csview"

# formatters
brew "black"
brew "isort"
brew "stylua"
