# casks
cask "firefox"
cask "ghostty"
cask "raycast"
cask "rectangle"
cask "wezterm"

# docker
brew "docker"
brew "docker-compose"
brew "colima"

# file viewers
brew "csview"
brew "jless"
brew "yazi"

# formatters
brew "black"
brew "isort"
brew "stylua"
brew "prettierd"

# general
brew "eza"
brew "lazygit"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"

# linters
brew "eslint"
brew "vscode-langservers-extracted"

# lua
brew "lua-language-server"

# markdown
brew "marksman"

# node
brew "fnm"
brew "node"
brew "typescript"

# neovim
brew "luarocks"
brew "neovim"
brew "ripgrep"
brew "tree-sitter"
brew "unzip"

# nerd fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-blex-mono-nerd-font"

# oh-my-zsh
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# python
brew "basedpyright"
brew "pyenv"
brew "pyenv-virtualenv"
brew "direnv"

# rust
brew "rust"
